In [1]:
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine

In [2]:
# Create engine using the `demographics.sqlite` database file
#engine = create_engine("sqlite:///db/belly_button_biodiversity.sqlite")
engine = create_engine("sqlite:///db/project2db.sqlite")
#engine = create_engine("sqlite:///db/twitter1.sqlite")

In [3]:
# Declare a Base using `automap_base()`
Base = automap_base()

In [4]:
# Use the Base class to reflect the database tables
Base.prepare(engine, reflect=True)

In [5]:
# Print all of the classes mapped to the Base
Base.classes.keys()

['BTC_Quotes1',
 'GLD_Quotes1',
 'SPX_Quotes1',
 'articles1',
 'country_coordinate1',
 'sentiment1',
 'tweets1',
 'tweets_loc1']

In [25]:
import csv, sqlite3
import pandas as pd

In [52]:
#Open database
db = sqlite3.connect('db/project2db.sqlite')

#READ TWEETS TABLE
query = "SELECT * FROM tweets_loc1;"
tweets = pd.read_sql_query(query,db)
tweets.head()

   location_id         location   latitude   longitude
0            1           Sydney -33.854816  151.216454
1            2           Wirral  53.340971   -3.050092
2            3  South East Asia  51.783559   -1.488763
3            4          Denmark  55.670249   10.333328
4            5        Boston MA  42.360253  -71.058291

In [53]:
db.close()

In [ ]:
#Open database
db = sqlite3.connect('db/belly_button_biodiversity.sqlite')

#READ TWEETS TABLE
query = "SELECT * FROM samples;"
tweets = pd.read_sql_query(query,db)
tweets.head()

In [ ]:
db.close()